
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>モバイル・バックエンドの作成 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.backend-2.html" />
    
    
    <link rel="prev" href="2.backend.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    はじめに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="2.backend.html">
            
                <a href="2.backend.html">
            
                    
                    モバイル・バックエンドの作成とテスト
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="2.backend-1.html">
            
                <a href="2.backend-1.html">
            
                    
                    モバイル・バックエンドの作成
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="2.backend-2.html">
            
                <a href="2.backend-2.html">
            
                    
                    RAMLドキュメントを使用したAPIの定義とテスト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="2.backend-3.html">
            
                <a href="2.backend-3.html">
            
                    
                    モバイル・バックエンドとカスタムAPIの関連づけ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="2.backend-4.html">
            
                <a href="2.backend-4.html">
            
                    
                    カスタムAPIのコール
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="2.backend-5.html">
            
                <a href="2.backend-5.html">
            
                    
                    モバイル・バックエンドの診断情報の確認
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="3.bs.html">
            
                <a href="3.bs.html">
            
                    
                    業務システムへの接続の構成
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="3.bs-1.html">
            
                <a href="3.bs-1.html">
            
                    
                    SOAP Webサービスに対するコネクタの定義とテスト
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="4.api.html">
            
                <a href="4.api.html">
            
                    
                    カスタムAPIの実装
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="4.api-1.html">
            
                <a href="4.api-1.html">
            
                    
                    JavaScript Scaffoldのダウンロード
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="4.api-2.html">
            
                <a href="4.api-2.html">
            
                    
                    Node.jsによるAPIの実装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="4.api-3.html">
            
                <a href="4.api-3.html">
            
                    
                    コネクタを利用するAPIの実装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="4.api-4.html">
            
                <a href="4.api-4.html">
            
                    
                    コネクタ使ったAPIの編集
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >モバイル・バックエンドの作成</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x4F5C;&#x6210;">&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x4F5C;&#x6210;</h2>
<p>&#x3053;&#x3053;&#x3067;&#x306F;&#x3001;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x3059;&#x3002;&#x307E;&#x305F;&#x3001;AMCe&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x30FB;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x304C;&#x63D0;&#x4F9B;&#x3057;&#x3066;&#x3044;&#x308B;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x69CB;&#x6210;&#x306E;&#x305F;&#x3081;&#x306E;&#x6A5F;&#x80FD;&#x306B;&#x3064;&#x3044;&#x3066;&#x4E00;&#x901A;&#x308A;&#x8AAC;&#x660E;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><strong>Step-1</strong> AMCe&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x30FB;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306B;&#x30ED;&#x30B0;&#x30A4;&#x30F3;&#x3057;&#x307E;&#x3059;&#x3002;&#x300C;&#x30DB;&#x30FC;&#x30E0;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x305F;&#x3089;&#x3001;&#x753B;&#x9762;&#x5DE6;&#x4E0A;&#x306B;&#x3042;&#x308B;&#x30CF;&#x30F3;&#x30D0;&#x30FC;&#x30AC;&#x30FC;&#x30FB;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_1.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x753B;&#x9762;&#x5DE6;&#x4E0A;&#x306E;&#x30CF;&#x30F3;&#x30D0;&#x30FC;&#x30AC;&#x30FC;&#x30FB;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;</strong>
</span></p>
<p><strong>Step-2</strong> &#x753B;&#x9762;&#x306E;&#x5DE6;&#x5074;&#x306B;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x30FB;&#x30D1;&#x30CD;&#x30EB;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x300C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x300D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x3066;&#x3001;&#x300C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3092;&#x958B;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_2.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x753B;&#x9762;&#x5DE6;&#x306E;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x304B;&#x3089;&#x300C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x300D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;</strong>
</span></p>
<p>&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x306E;&#x53F3;&#x6A2A;&#x306B;&#x3042;&#x308B;&#x30CF;&#x30F3;&#x30D0;&#x30FC;&#x30AC;&#x30FC;&#x30FB;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x3068;&#x3001;&#x30E1;&#x30CB;&#x30E5;&#x30FC;&#x3092;&#x9589;&#x3058;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><strong>Step-3</strong> &#x300C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x3042;&#x308B;&#x300C;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_3.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x300C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x300C;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;</strong>
</span></p>
<p><strong>Step-4</strong> &#x300C;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x300C;&#x65B0;&#x898F;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_4.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x3010;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x304C;&#x307E;&#x3060;&#x4E00;&#x3064;&#x3082;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x5834;&#x5408;&#x3011;&#x300C;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p><span style="display:block;text-align:center"><img src="images/2_5.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x3010;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x304C;&#x3059;&#x3067;&#x306B;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x5834;&#x5408;&#x3011;&#x300C;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p><strong>Step-5</strong> &#x300C;&#x65B0;&#x898F;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x30C0;&#x30A4;&#x30A2;&#x30ED;&#x30B0;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x304C;&#x30DD;&#x30C3;&#x30D7;&#x30A2;&#x30C3;&#x30D7;&#x3057;&#x307E;&#x3059;&#x3002;&#x4E0B;&#x8A18;&#x306E;&#x8868;&#x306E;&#x3088;&#x3046;&#x306B;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x540D;&#x524D;&#x3068;&#x8AAC;&#x660E;&#x3092;&#x5165;&#x529B;&#x3057;&#x3066;&#x300C;&#x4F5C;&#x6210;&#x300D;&#x30DC;&#x30BF;&#x30F3;&#x3092;&#x30AF;&#x30EA;&#x30C3;&#x30AF;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><strong>&#x8868;&#xFF1A;&#x300C;&#x65B0;&#x898F;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x30C0;&#x30A4;&#x30A2;&#x30ED;&#x30B0;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x306B;&#x5165;&#x529B;&#x3059;&#x308B;&#x5024;</strong></p>
<table>
<thead>
<tr>
<th style="text-align:left">&#x5165;&#x529B;&#x9805;&#x76EE;</th>
<th style="text-align:left">&#x8AAC;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">&#x540D;&#x524D;</td>
<td style="text-align:left">FIF_Technician_xx<br>&#xFF08;xx&#x306F;AMCe&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x5185;&#x3067;&#x4E00;&#x610F;&#x3068;&#x306A;&#x308B;&#x6587;&#x5B57;&#x5217;&#xFF09;</td>
</tr>
<tr>
<td style="text-align:left">&#x8AAC;&#x660E;</td>
<td style="text-align:left">&#xFF08;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x3092;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x4EFB;&#x610F;&#x306E;&#x6587;&#x5B57;&#x5217;&#xFF09;</td>
</tr>
</tbody>
</table>
<p><span style="display:block;text-align:center"><img src="images/2_6.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x300C;&#x65B0;&#x898F;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x300D;&#x30C0;&#x30A4;&#x30A2;&#x30ED;&#x30B0;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;</strong>
</span></p>
<p><strong>Step-6</strong> &#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x304C;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x305F;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x8A2D;&#x5B9A;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x7528;&#x3044;&#x308B;&#x8A8D;&#x8A3C;&#x65B9;&#x5F0F;&#x306A;&#x3069;&#x3001;AMCe&#x4E0A;&#x306E;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x306E;&#x8A2D;&#x5B9A;&#x304A;&#x3088;&#x3073;&#x78BA;&#x8A8D;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_7.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x8A2D;&#x5B9A;&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p><strong>Step-7</strong> &#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x8A3A;&#x65AD;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x3001;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306B;&#x95A2;&#x9023;&#x4ED8;&#x3051;&#x3089;&#x308C;&#x305F;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x304B;&#x3089;&#x306E;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x72B6;&#x6CC1;&#x306E;&#x78BA;&#x8A8D;&#x3084;&#x30ED;&#x30B0;&#x3092;&#x53C2;&#x7167;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_8.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x8A3A;&#x65AD;&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p><strong>Step-8</strong> &#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x3001;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x3092;&#x4ECB;&#x3057;&#x3066;AMCe&#x4E0A;&#x306E;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x767B;&#x9332;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_9.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p>&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x901A;&#x77E5;&#x3092;&#x9001;&#x4FE1;&#x3059;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;&#x30D7;&#x30E9;&#x30C3;&#x30C8;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x3054;&#x3068;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x8A3C;&#x660E;&#x66F8;&#x306A;&#x3069;&#x306E;&#x60C5;&#x5831;&#x3092;&#x767B;&#x9332;&#x3057;&#x307E;&#x3059;&#x3002;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x901A;&#x77E5;&#x3092;&#x9001;&#x4FE1;&#x3057;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x306E;&#x767B;&#x9332;&#x306F;&#x5FC5;&#x9808;&#x3067;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x767B;&#x9332;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x8B58;&#x5225;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30AD;&#x30FC;&#x304C;&#x767A;&#x884C;&#x3055;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x3054;&#x3068;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x72B6;&#x6CC1;&#x3092;&#x76E3;&#x8996;&#x307E;&#x305F;&#x306F;&#x5206;&#x6790;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><strong>Step-9</strong> &#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;Security&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x3001;Role-based Access&#x3092;&#x53EF;&#x80FD;&#x306B;&#x3057;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x30FB;&#x30ED;&#x30FC;&#x30EB;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#xFF08;&#x3055;&#x3089;&#x306B;&#x3001;&#x305D;&#x308C;&#x304C;&#x8868;&#x3059;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#xFF09;&#x306B;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x306E;&#x8FFD;&#x52A0;&#x30EC;&#x30A4;&#x30E4;&#x30FC;&#x3092;&#x63D0;&#x4F9B;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_10.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;Security&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p><strong>Step-10</strong> &#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;API&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x3001;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x516C;&#x958B;&#x3059;&#x308B;&#x30AB;&#x30B9;&#x30BF;&#x30E0;API&#x3092;&#x9078;&#x629E;&#x3057;&#x307E;&#x3059;&#x3002;&#x8A73;&#x7D30;&#x306F;&#x300E;<a href="2.backend-3.html">&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x3068;&#x30AB;&#x30B9;&#x30BF;&#x30E0;API&#x306E;&#x95A2;&#x9023;&#x3065;&#x3051;</a>&#x300F;&#x3067;&#x8AAC;&#x660E;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_10_1.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;API&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p><strong>Step-11</strong> &#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B8;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x306F;&#x3001;AMCe&#x306E;&#x30D7;&#x30E9;&#x30C3;&#x30C8;&#x30D5;&#x30A9;&#x30FC;&#x30E0;API&#x306E;&#xFF11;&#x3064;&#x3001;Storage API&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30FB;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x30FB;&#x30B5;&#x30A4;&#x30C9;&#x306B;&#x6C38;&#x7D9A;&#x5316;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x69CB;&#x6210;&#x60C5;&#x5831;&#x3092;&#x9078;&#x629E;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_11.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x30B9;&#x30C8;&#x30EC;&#x30FC;&#x30B8;&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p><strong>Step-12</strong> &#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x901A;&#x77E5;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3068;&#x3001;&#x300C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x767B;&#x9332;&#x3057;&#x305F;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x901A;&#x77E5;&#x3092;&#x9001;&#x4FE1;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x901A;&#x77E5;&#x3092;&#x9001;&#x4FE1;&#x3059;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;iOS&#x3084;Android&#x3001;Windows&#x3067;&#x305D;&#x308C;&#x305E;&#x308C;&#x624B;&#x7D9A;&#x304D;&#x304C;&#x7570;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;AMCe&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x3069;&#x306E;&#x30D7;&#x30E9;&#x30C3;&#x30C8;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x3092;&#x610F;&#x8B58;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x300C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x304B;&#x3089;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x3092;&#x9069;&#x5207;&#x306B;&#x767B;&#x9332;&#x3055;&#x308C;&#x3066;&#x3044;&#x308C;&#x3070;&#x3001;&#x4E00;&#x5EA6;&#x306B;&#x8907;&#x6570;&#x306E;&#x30D7;&#x30E9;&#x30C3;&#x30C8;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x306E;&#x7AEF;&#x672B;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x30D7;&#x30C3;&#x30B7;&#x30E5;&#x901A;&#x77E5;&#x3092;&#x9001;&#x4FE1;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_12.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x901A;&#x77E5;&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>
<p><strong>Step-13</strong> &#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30FB;&#x30DD;&#x30EA;&#x30B7;&#x30FC;&#x300D;&#x30DA;&#x30FC;&#x30B8;&#x3067;&#x306F;&#x3001;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30A2;&#x30D7;&#x30EA;&#x304C;&#x5171;&#x901A;&#x3067;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x30AB;&#x30B9;&#x30BF;&#x30E0;&#x30FB;&#x30D7;&#x30ED;&#x30D1;&#x30C6;&#x30A3;&#x3092;&#x5B9A;&#x7FA9;&#x3057;&#x3001;&#x5024;&#x3092;&#x5236;&#x5FA1;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30FB;&#x30DD;&#x30EA;&#x30B7;&#x30FC;&#x306E;&#x5024;&#x306F;&#x3001;&#x30D7;&#x30E9;&#x30C3;&#x30C8;&#x30D5;&#x30A9;&#x30FC;&#x30E0;API&#x306B;&#x3088;&#x3063;&#x3066;&#x7C21;&#x5358;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<p><span style="display:block;text-align:center"><img src="images/2_14.png" alt=""><br>
<strong>&#x56F3;&#xFF1A;&#x30E2;&#x30D0;&#x30A4;&#x30EB;&#x30FB;&#x30D0;&#x30C3;&#x30AF;&#x30A8;&#x30F3;&#x30C9;&#x306E;&#x300C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30FB;&#x30DD;&#x30EA;&#x30B7;&#x30FC;&#x300D;&#x30DA;&#x30FC;&#x30B8;</strong>
</span></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2.backend.html" class="navigation navigation-prev " aria-label="Previous page: モバイル・バックエンドの作成とテスト">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2.backend-2.html" class="navigation navigation-next " aria-label="Next page: RAMLドキュメントを使用したAPIの定義とテスト">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"モバイル・バックエンドの作成","level":"1.2.1","depth":2,"next":{"title":"RAMLドキュメントを使用したAPIの定義とテスト","level":"1.2.2","depth":2,"path":"contents/2.backend-2.md","ref":"contents/2.backend-2.md","articles":[]},"previous":{"title":"モバイル・バックエンドの作成とテスト","level":"1.2","depth":1,"path":"contents/2.backend.md","ref":"contents/2.backend.md","articles":[{"title":"モバイル・バックエンドの作成","level":"1.2.1","depth":2,"path":"contents/2.backend-1.md","ref":"contents/2.backend-1.md","articles":[]},{"title":"RAMLドキュメントを使用したAPIの定義とテスト","level":"1.2.2","depth":2,"path":"contents/2.backend-2.md","ref":"contents/2.backend-2.md","articles":[]},{"title":"モバイル・バックエンドとカスタムAPIの関連づけ","level":"1.2.3","depth":2,"path":"contents/2.backend-3.md","ref":"contents/2.backend-3.md","articles":[]},{"title":"カスタムAPIのコール","level":"1.2.4","depth":2,"path":"contents/2.backend-4.md","ref":"contents/2.backend-4.md","articles":[]},{"title":"モバイル・バックエンドの診断情報の確認","level":"1.2.5","depth":2,"path":"contents/2.backend-5.md","ref":"contents/2.backend-5.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"contents/2.backend-1.md","mtime":"2018-10-08T07:07:28.205Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-10-08T07:18:51.658Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

